/* error dialog default title */
TIME_MACHINE_ERROR = "O Time Machine não pôde concluir o backup.";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Abrir a Preferência Time Machine…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "Os ajustes do Time Machine neste computador são controlados por Preferências Gerenciadas - entre em contato com seu Administrador do Sistema. ";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "Nenhum erro.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Impossível iniciar o Time Machine.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Não foi possível completar o backup. Ocorreu um erro ao criar a pasta de backup."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "O disco de backup não está no formato Mac OS Expandido (Reg. Cronológico), o que é necessário.\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup diferente.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Não foi possível obter o estado do disco de backup."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "O disco de backup não possui o proprietário ativado. Você deve possuir proprietário ativado para utilizar este disco para os backups do Time Machine.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup diferente.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "O disco de backup não está no formato Mac OS Expandido (Reg. Cronológico), o que é necessário.\n\n%@";
RESULTCODE_6_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup diferente."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "Este backup é muito grande para o disco de backup. O backup requer %@, mas há somente %@ disponíveis.\n\n%@";
RESULTCODE_7_SHOWPREFS = "O Time Machine necessita de espaço de trabalho no disco de backup, além do espaço necessário para armazenar backups. Abra a preferência Time Machine para selecionar um disco de backup maior ou torne o backup menor excluindo arquivos."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Os arquivos não podem ser copiados no disco de backup porque este parece ser “somente de leitura”\n\n%@";
RESULTCODE_8_SHOWPREFS = "Talvez você tenha que reparar ou formatar novamente o disco usando o Utilitário de Disco. Se o disco não puder ser reparado, você deve usar um disco diferente para os backups. Abra as preferências do Time Machine para selecionar outro disco de backup."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "O disco de backup não possui as Listas de Controle de Acesso ativadas, o que é necessário.\n\n%@";
RESULTCODE_9_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup diferente."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "Um erro ocorreu ao preparar o backup."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "O backup não foi realizado porque ocorreu um erro ao copiar os arquivos no disco de backup.";
RESULTCODE_11_MESSAGE = "Talvez o problema seja temporário. Tente fazer o backup novamente mais tarde. Se o problema persistir, use o Utilitário de Disco para reparar seu disco de backup.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "Ocorreu um erro ao vincular arquivos no disco de backup."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "Muitos arquivos alterados durante o backup. "; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "Ocorreu um erro ao tentar remover os backups expirados do disco de backup.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "Todos os backups expirados foram removidos, mas o disco de backup ainda está cheio.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup maior.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "Todos os backups expirados foram removidos, mas o disco de backup ainda está cheio.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup maior."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "Nenhum disco de backup foi selecionado.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "O disco de backup não pôde ser encontrado.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Certifique-se de que o disco de backup está conectado ou abra a preferência Time Machine para selecionar um disco de backup diferente."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "O disco do backup não está disponível."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "A imagem do disco de backup “%@” não pôde ser criada (erro %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "A imagem do disco de backup “%@” não pôde ser acessada (erro %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Backup cancelado."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "Um disco que você está fazendo o backup é sensível a maiúsculas e minúsculas, mas o disco de backup não é.\n\n%@";
RESULTCODE_23_SHOWPREFS = " Abrir a preferência Time Machine para selecionar um disco de backup diferente ou para escolher não fazer backup em um disco sensível a maiúsculas e minúsculas."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "Dois dos discos de backup possuem o mesmo nome. Por favor, renomeie um deles."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "Não há discos disponíveis para realizar o backup. Isso pode ocorrer se todos os discos estiverem na lista “Não fazer o backup”.\n\n%@";
RESULTCODE_25_SHOWPREFS = "Para editar a lista, abra as preferências do Time Machine e clique em Opções.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "O Time Machine não pôde terminar o backup devido a um problema de rede.";
RESULTCODE_26_MESSAGE = "Certifique-se de que o seu computador e o disco de backup estão na mesma rede e que o disco de backup está ativado. Em seguida, tente fazer o backup novamente.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "Talvez o disco de backup tenha sido ejetado ou desconectado do seu computador.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "O disco de backup ficou sem espaço inesperadamente. O Time Machine tentará disponibilizar mais espaço removendo os backups expirados durante o próximo backup programado.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Abrir a preferência Time Machine para selecionar um disco de backup maior ou para tornar o backup menor, excluindo arquivos."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "O disco de rede do backup não pôde ser acessado porque houve um problema com o nome ou senha do usuário da rede.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Abrir a preferência Time Machine para selecionar o disco de backup de rede e digitar novamente o nome de usuário e a senha corretos. ";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "Ocorreu um erro ao tentar reutilizar o backup “%@”.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "A imagem do disco de backup “%@” já está em uso.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "A imagem do disco de backup “%@” não pôde ser encontrada.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "A data e a hora do sistema são incorretos. ";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "O computador não possui uma interface de rede primária. ";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "O Time Machine não pôde encontrar alguns dos seus ajustes.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Para reestabelecer os ajustes do Time Machine, abra a Preferência Time Machine e selecione novamente o disco de backup.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "O Time Machine não pôde encontrar alguns ajustes do disco de backup “%@”.\n\nCertifique-se de que o disco está conectado e que os outos discos conectados não utilizam o mesmo nome que o disco de backup.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Para reestabelecer os ajustes do Time Machine, abra a Preferência Time Machine e selecione novamente o disco de backup.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "Talvez um dos discos do qual estava sendo feito backup tenha sido ejetado ou desconectado do seu computador.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "O Time Machine não pode usar a imagem de disco porque ela não permite gravação.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "O Time Machine não pôde verificar seus backups porque o disco de backup não está disponível.";
RESULTCODE_40_MESSAGE = "Certifique-se de que o seu computador e o disco de backup estejam na mesma rede e de que o disco de backup esteja ativado. Em seguida, tente verificar seus backups novamente.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "O Time Machine não pôde verificar seus backups.";
RESULTCODE_41_MESSAGE = "O disco de backup parece ser “apenas de leitura”.";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "O Time Machine não pôde verificar seus backups porque a verificação foi interrompida.";
RESULTCODE_42_MESSAGE = "As interrupções normalmente são provocadas por problemas da rede. Tente novamente quando os problemas da rede estiverem resolvidos.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "O Time Machine não pôde abandonar a imagem de disco de backup existente “%@”";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "O Time Machine não pôde apagar a imagem de disco de backup “%@”";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Código de erro: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "O disco de backup está quase cheio.";
RESULTCODE_1000_MESSAGE = "Quando o disco de backup estiver cheio, o Time Machine apagará os backups antigos para que haja espaço para os novos.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "Se você preferir manter todos os seus backups antigos, abra a preferência Time Machine para selecionar um novo disco de backup";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "O disco de backup está cheio.";
RESULTCODE_1001_MESSAGE = "O Time Machine apagou um ou mais backups antigos para que haja espaço para novos backups. O backup mais antigo restante é : %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "Para evitar apagar backups adicionais antigos, abra a preferência Time Machine para selecionar um disco de backup diferente."; 
RESULTCODE_1001_CHECKBOX = "Não mostrar este aviso novamente.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "O Time Machine não realizou o backup em seu computador em %@ dias.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Certifique-se de que o seu disco de backup esteja disponível ou abra as preferências do Time Machine para selecionar um novo disco de backup.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Você gostaria de reutilizar o backup \"%@\" com este computador?";
RESULTCODE_1003_MESSAGE = "O backup foi criado em um computador diferente. Se você reutilizar este backup, ele não poderá mais ser utilizado pelo computador original.";
REUSE_BACKUP_BUTTON = "Reutilizar Backup";
CREATE_NEW_BACKUP_BUTTON = "Criar Novo Backup";
ASK_LATER_BUTTON = "Não Criar Backup Agora";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "Há uma atualização disponível para “%@.”";
RESULTCODE_1004_MESSAGE = "Esta atualização melhora a confiabilidade do Time Capsule. Para instalar a atualização, abra o Utilitário AirPort. Talvez você precise digitar a senha do Time Capsule para “%@”.";
REMIND_LATER_BUTTON = "Atualizar Mais Tarde";
AIRPORT_UTILITY_BUTTON = "Abrir o Utilitário AirPort…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "O Time Machine completou a verificação dos seus backups. Para melhorar a confiabilidade, o Time Machine precisa criar um novo backup para você.";
RESULTCODE_1006_MESSAGE = "Clique em Iniciar Novo Backup para criar um novo backup, o que removerá o histórico dos seus backups. Esse processo pode demorar várias horas.\n\nClique em Criar Backup Mais Tarde para ser avisado(a) no dia seguinte. O Time Machine não criará backups durante esse período.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Iniciar Novo Backup";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Criar Backup Mais Tarde";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "A identidade do disco de backup mudou desde o backup anterior.";
RESULTCODE_1008_MESSAGE = "Talvez o disco tenha sido substituído, apagado ou alguém esteja tentando “enganar” o seu computador e fazer com que ele crie um backup no disco errado.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Usar Este Disco";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Não Criar Backup";

// UNITS
KB = "KB";
MB = "MB";
GB = "GB";
TB = "TB";
